---
kind: property
id: P:Autodesk.Revit.DB.Parameter.HasValue
zh: 参数、共享参数
source: html/2761a43b-3199-bbbb-6e6d-8ffd82febdec.htm
---
# Autodesk.Revit.DB.Parameter.HasValue Property

**中文**: 参数、共享参数

Identifies if the parameter has an assigned value.

## Syntax (C#)
```csharp
public bool HasValue { get; }
```